---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementRegenFail
source: html/6cd734cc-5ab4-97dc-a425-182f034ad976.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementRegenFail Property

Can't regenerate Area Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaReinforcementRegenFail { get; }
```